Revit 2027 API
BuiltInFailures.ScaleFailures.CannotScaleLinkWithSharedCoordinates Property
 Can't scale link that shares coordinates with host model
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotScaleLinkWithSharedCoordinates { get; }
Public Shared ReadOnly Property CannotScaleLinkWithSharedCoordinates As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotScaleLinkWithSharedCoordinates {
	FailureDefinitionId^ get ();
}
static member CannotScaleLinkWithSharedCoordinates : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ScaleFailures Class
Autodesk.Revit.DB Namespace